app/controllers/user_profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1  [["user_id", 1]]
---
  def index
    render json: { userProfiles: User.find(params[:user_id]).user_profiles}, status: 200